Revit 2017 API
Document.NewFoundationWall Method
Creates a new wall foundation object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2017. Use WallFoundation.Create() instead.")]
public WallFoundation NewFoundationWall(
	WallFoundationType wallFoundationType,
	Wall wall
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2017. Use WallFoundation.Create() instead.")> _
Public Function NewFoundationWall ( _
	wallFoundationType As WallFoundationType, _
	wall As Wall _
) As WallFoundation
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2017. Use WallFoundation.Create() instead.")]
public:
WallFoundation^ NewFoundationWall(
	WallFoundationType^ wallFoundationType,
	Wall^ wall
)
Parameters
wallFoundationType
Type: Autodesk.Revit.DB.WallFoundationType
The WallFoundation type.
wall
Type: Autodesk.Revit.DB.Wall
The Wall to append a WallFoundation.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the wall foundation type does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the wall does not exist in the given document.
See Also
Document Class
Autodesk.Revit.Creation Namespace